```
SETUP: tests/oci_core_boot_volume_backup []

PRETEST: tests/oci_core_boot_volume_backup

TEST: tests/oci_core_boot_volume_backup
Running terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_boot_volume_backup.test_boot_volume_backup will be created
  + resource "oci_core_boot_volume_backup" "test_boot_volume_backup" {
      + boot_volume_id               = (known after apply)
      + compartment_id               = (known after apply)
      + defined_tags                 = (known after apply)
      + display_name                 = "steampipetest4815"
      + expiration_time              = (known after apply)
      + freeform_tags                = {
          + "Department" = "Finance"
        }
      + id                           = (known after apply)
      + image_id                     = (known after apply)
      + kms_key_id                   = (known after apply)
      + size_in_gbs                  = (known after apply)
      + source_boot_volume_backup_id = (known after apply)
      + source_type                  = (known after apply)
      + state                        = (known after apply)
      + system_tags                  = (known after apply)
      + time_created                 = (known after apply)
      + time_request_received        = (known after apply)
      + type                         = (known after apply)
      + unique_size_in_gbs           = (known after apply)
    }

  # oci_core_image.test_image will be created
  + resource "oci_core_image" "test_image" {
      + agent_features           = (known after apply)
      + base_image_id            = (known after apply)
      + billable_size_in_gbs     = (known after apply)
      + compartment_id           = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
      + create_image_allowed     = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = "steampipetest4815"
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + launch_mode              = (known after apply)
      + launch_options           = (known after apply)
      + listing_type             = (known after apply)
      + operating_system         = (known after apply)
      + operating_system_version = (known after apply)
      + size_in_mbs              = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)

      + image_source_details {
          + bucket_name    = "steampipetest4815"
          + namespace_name = "bmqeqvslavsz"
          + object_name    = "test"
          + source_type    = "objectStorageTuple"
        }
    }

  # oci_core_instance.test_instance will be created
  + resource "oci_core_instance" "test_instance" {
      + availability_domain                 = "TvRS:AP-MUMBAI-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + numa_nodes_per_socket = (known after apply)
          + type                  = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = (known after apply)
          + source_type             = "image"
        }
    }

  # oci_core_subnet.named_test_resource will be created
  + resource "oci_core_subnet" "named_test_resource" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.0/16"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "steampipetest4815"
      + dns_label                  = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.named_test_resource will be created
  + resource "oci_core_vcn" "named_test_resource" {
      + cidr_block               = "10.0.0.0/16"
      + cidr_blocks              = (known after apply)
      + compartment_id           = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = "steampipetest4815"
      + dns_label                = (known after apply)
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + ipv6cidr_blocks          = (known after apply)
      + is_ipv6enabled           = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

  # oci_objectstorage_bucket.named_test_resource will be created
  + resource "oci_objectstorage_bucket" "named_test_resource" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "steampipetest4815"
      + namespace                    = "bmqeqvslavsz"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

  # oci_objectstorage_object.test_object will be created
  + resource "oci_objectstorage_object" "test_object" {
      + bucket                     = "steampipetest4815"
      + content                    = "098f6bcd4621d373cade4e832627b4f6"
      + content_length             = (known after apply)
      + content_md5                = (known after apply)
      + content_type               = (known after apply)
      + delete_all_object_versions = false
      + id                         = (known after apply)
      + namespace                  = "bmqeqvslavsz"
      + object                     = "test"
      + state                      = (known after apply)
      + storage_tier               = (known after apply)
      + version_id                 = (known after apply)
      + work_request_id            = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + boot_volume_id = (known after apply)
  + resource_id    = (known after apply)
  + resource_name  = "steampipetest4815"
  + tenancy_ocid   = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"
oci_core_vcn.named_test_resource: Creating...
oci_objectstorage_bucket.named_test_resource: Creating...
oci_objectstorage_bucket.named_test_resource: Creation complete after 0s [id=n/bmqeqvslavsz/b/steampipetest4815]
oci_objectstorage_object.test_object: Creating...
oci_core_vcn.named_test_resource: Creation complete after 1s [id=ocid1.vcn.oc1.ap-mumbai-1.amaaaaaa6igdexaaeu6kl6qqpsiapznqp5hc4x2otz77jj33u6tki5xgzzpq]
oci_core_subnet.named_test_resource: Creating...
oci_objectstorage_object.test_object: Creation complete after 1s [id=n/bmqeqvslavsz/b/steampipetest4815/o/test]
oci_core_image.test_image: Creating...
oci_core_subnet.named_test_resource: Creation complete after 2s [id=ocid1.subnet.oc1.ap-mumbai-1.aaaaaaaal3cjynug3jtnf3uq7rz4jy4el3ddvij3vbn57wu4hw3hw44kll4q]
oci_core_image.test_image: Still creating... [10s elapsed]
oci_core_image.test_image: Still creating... [20s elapsed]
oci_core_image.test_image: Still creating... [30s elapsed]
oci_core_image.test_image: Still creating... [40s elapsed]
oci_core_image.test_image: Still creating... [50s elapsed]
oci_core_image.test_image: Still creating... [1m0s elapsed]
oci_core_image.test_image: Still creating... [1m10s elapsed]
oci_core_image.test_image: Still creating... [1m20s elapsed]
oci_core_image.test_image: Still creating... [1m30s elapsed]
oci_core_image.test_image: Still creating... [1m40s elapsed]
oci_core_image.test_image: Still creating... [1m50s elapsed]
oci_core_image.test_image: Still creating... [2m0s elapsed]
oci_core_image.test_image: Still creating... [2m10s elapsed]
oci_core_image.test_image: Still creating... [2m20s elapsed]
oci_core_image.test_image: Still creating... [2m30s elapsed]
oci_core_image.test_image: Still creating... [2m40s elapsed]
oci_core_image.test_image: Still creating... [2m50s elapsed]
oci_core_image.test_image: Still creating... [3m0s elapsed]
oci_core_image.test_image: Still creating... [3m10s elapsed]
oci_core_image.test_image: Still creating... [3m20s elapsed]
oci_core_image.test_image: Still creating... [3m30s elapsed]
oci_core_image.test_image: Still creating... [3m40s elapsed]
oci_core_image.test_image: Still creating... [3m50s elapsed]
oci_core_image.test_image: Still creating... [4m0s elapsed]
oci_core_image.test_image: Still creating... [4m10s elapsed]
oci_core_image.test_image: Still creating... [4m20s elapsed]
oci_core_image.test_image: Still creating... [4m30s elapsed]
oci_core_image.test_image: Still creating... [4m40s elapsed]
oci_core_image.test_image: Still creating... [4m50s elapsed]
oci_core_image.test_image: Still creating... [5m0s elapsed]
oci_core_image.test_image: Still creating... [5m10s elapsed]
oci_core_image.test_image: Still creating... [5m20s elapsed]
oci_core_image.test_image: Still creating... [5m30s elapsed]
oci_core_image.test_image: Still creating... [5m40s elapsed]
oci_core_image.test_image: Still creating... [5m50s elapsed]
oci_core_image.test_image: Still creating... [6m0s elapsed]
oci_core_image.test_image: Still creating... [6m10s elapsed]
oci_core_image.test_image: Still creating... [6m20s elapsed]
oci_core_image.test_image: Still creating... [6m30s elapsed]
oci_core_image.test_image: Still creating... [6m40s elapsed]
oci_core_image.test_image: Still creating... [6m50s elapsed]
oci_core_image.test_image: Still creating... [7m0s elapsed]
oci_core_image.test_image: Still creating... [7m10s elapsed]
oci_core_image.test_image: Still creating... [7m20s elapsed]
oci_core_image.test_image: Still creating... [7m30s elapsed]
oci_core_image.test_image: Still creating... [7m40s elapsed]
oci_core_image.test_image: Still creating... [7m50s elapsed]
oci_core_image.test_image: Still creating... [8m0s elapsed]
oci_core_image.test_image: Still creating... [8m10s elapsed]
oci_core_image.test_image: Still creating... [8m20s elapsed]
oci_core_image.test_image: Still creating... [8m30s elapsed]
oci_core_image.test_image: Still creating... [8m40s elapsed]
oci_core_image.test_image: Still creating... [8m50s elapsed]
oci_core_image.test_image: Still creating... [9m0s elapsed]
oci_core_image.test_image: Still creating... [9m10s elapsed]
oci_core_image.test_image: Still creating... [9m20s elapsed]
oci_core_image.test_image: Still creating... [9m30s elapsed]
oci_core_image.test_image: Still creating... [9m40s elapsed]
oci_core_image.test_image: Still creating... [9m50s elapsed]
oci_core_image.test_image: Still creating... [10m0s elapsed]
oci_core_image.test_image: Still creating... [10m10s elapsed]
oci_core_image.test_image: Still creating... [10m20s elapsed]
oci_core_image.test_image: Still creating... [10m30s elapsed]
oci_core_image.test_image: Still creating... [10m40s elapsed]
oci_core_image.test_image: Still creating... [10m50s elapsed]
oci_core_image.test_image: Still creating... [11m0s elapsed]
oci_core_image.test_image: Still creating... [11m10s elapsed]
oci_core_image.test_image: Still creating... [11m20s elapsed]
oci_core_image.test_image: Still creating... [11m30s elapsed]
oci_core_image.test_image: Still creating... [11m40s elapsed]
oci_core_image.test_image: Still creating... [11m50s elapsed]
oci_core_image.test_image: Still creating... [12m0s elapsed]
oci_core_image.test_image: Still creating... [12m10s elapsed]
oci_core_image.test_image: Still creating... [12m20s elapsed]
oci_core_image.test_image: Still creating... [12m30s elapsed]
oci_core_image.test_image: Creation complete after 12m32s [id=ocid1.image.oc1.ap-mumbai-1.aaaaaaaar4hobxoc7lde3tx2whs2dfnxz22xy3uasbzquzufc345ghp4d5ka]
oci_core_instance.test_instance: Creating...
oci_core_instance.test_instance: Still creating... [10s elapsed]
oci_core_instance.test_instance: Still creating... [20s elapsed]
oci_core_instance.test_instance: Still creating... [30s elapsed]
oci_core_instance.test_instance: Still creating... [40s elapsed]
oci_core_instance.test_instance: Creation complete after 44s [id=ocid1.instance.oc1.ap-mumbai-1.anrg6ljr6igdexaciourwtdplqvia7ppiaqztimmquri7wpfx3kouqvycdoa]
oci_core_boot_volume_backup.test_boot_volume_backup: Creating...
oci_core_boot_volume_backup.test_boot_volume_backup: Still creating... [10s elapsed]
oci_core_boot_volume_backup.test_boot_volume_backup: Still creating... [20s elapsed]
oci_core_boot_volume_backup.test_boot_volume_backup: Still creating... [30s elapsed]
oci_core_boot_volume_backup.test_boot_volume_backup: Still creating... [40s elapsed]
oci_core_boot_volume_backup.test_boot_volume_backup: Creation complete after 44s [id=ocid1.bootvolumebackup.oc1.ap-mumbai-1.abrg6ljrlzhh5itgepuvm3eh7rddvu2wkveus3ecdbouaynkqil4zu3bfscq]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

Outputs:

boot_volume_id = "ocid1.bootvolume.oc1.ap-mumbai-1.abrg6ljrsnghlqprw2d6nmwid32wrzxl2hywnjkfrywlgedhw2y2w2z3vjua"
resource_id = "ocid1.bootvolumebackup.oc1.ap-mumbai-1.abrg6ljrlzhh5itgepuvm3eh7rddvu2wkveus3ecdbouaynkqil4zu3bfscq"
resource_name = "steampipetest4815"
tenancy_ocid = "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq"

Running SQL query: test-get-query.sql

[
  {
    "boot_volume_id": "ocid1.bootvolume.oc1.ap-mumbai-1.abrg6ljrsnghlqprw2d6nmwid32wrzxl2hywnjkfrywlgedhw2y2w2z3vjua",
    "display_name": "steampipetest4815",
    "freeform_tags": {
      "Department": "Finance"
    },
    "id": "ocid1.bootvolumebackup.oc1.ap-mumbai-1.abrg6ljrlzhh5itgepuvm3eh7rddvu2wkveus3ecdbouaynkqil4zu3bfscq",
    "lifecycle_state": "AVAILABLE",
    "size_in_gbs": 47
  }
]
✔ PASSED

Running SQL query: test-list-query.sql

[
  {
    "boot_volume_id": "ocid1.bootvolume.oc1.ap-mumbai-1.abrg6ljrsnghlqprw2d6nmwid32wrzxl2hywnjkfrywlgedhw2y2w2z3vjua",
    "display_name": "steampipetest4815",
    "freeform_tags": {
      "Department": "Finance"
    },
    "id": "ocid1.bootvolumebackup.oc1.ap-mumbai-1.abrg6ljrlzhh5itgepuvm3eh7rddvu2wkveus3ecdbouaynkqil4zu3bfscq",
    "lifecycle_state": "AVAILABLE",
    "size_in_gbs": 47
  }
]
✔ PASSED

Running SQL query: test-notfound-query.sql

null
✔ PASSED

Running SQL query: test-turbot-query.sql

[
  {
    "tenant_id": "ocid1.tenancy.oc1..aaaaaaaahnm7gleh5soecxzjetci3yjjnjqmfkr4po3hoz4p4h2q37cyljaq",
    "title": "steampipetest4815"
  }
]
✔ PASSED

POSTTEST: tests/oci_core_boot_volume_backup

TEARDOWN: tests/oci_core_boot_volume_backup

SUMMARY:

1/1 passed.
```